{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the removal of blur backgrounds from text lines in the memories page, with high confidence and test ID REQ-1.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a multi-page romantic website with photo galleries, interactive questions, animations, and navigation.",
  "frontend/index.css": "Duplicate Tailwind configuration file with CSS custom properties for light and dark mode color schemes using OKLCH format.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx, titled 'Love Letter'.",
  "frontend/README.md": "Documentation instructing users how to replace 9 placeholder photos (photo1.jpg through photo9.jpg) in the assets directory to personalize the romantic website.",
  "frontend/src/App.tsx": "React Router setup defining 6 routes (landing, memories, understanding, one-chance, game, final) wrapped in a Layout component.",
  "frontend/src/components/ActionButtonsSection.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ClosingSection.tsx": "Empty component file with no implementation.",
  "frontend/src/components/GallerySection.tsx": "Empty component file with no implementation.",
  "frontend/src/components/HeroSection.tsx": "Empty component file with no implementation.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing pink background, floating hearts animation, and footer with caffeine.ai attribution for all pages.",
  "frontend/src/components/QuestionSection.tsx": "Empty component file with no implementation.",
  "frontend/src/components/UnderstandingSection.tsx": "Empty component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing ICP backend actor creation with Internet Identity authentication, query caching, and automatic invalidation on identity changes.",
  "frontend/src/hooks/useHeartAnimation.ts": "Custom hook that creates and animates 20 floating heart emojis across the viewport with random positioning and sizes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Tailwind CSS with custom OKLCH color system for romantic pink/gold theme, glowing text effects, floating hearts animations, photo collage backgrounds, and responsive utilities.",
  "frontend/src/main.tsx": "React application entry point wrapping App with QueryClientProvider and InternetIdentityProvider, rendering to root element.",
  "frontend/src/pages/FinalPage.tsx": "Final page displaying glowing commitment message in Hinglish, consolidated subtext paragraph, automatic heart animation on mount, and back navigation button.",
  "frontend/src/pages/GamePage.tsx": "Interactive question page with animated 'No' button that moves on click and a 'Yes' button that triggers heart animations and displays confirmation messages.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with a centered heading, subtitle text, and a button that navigates to the memories page.",
  "frontend/src/pages/MemoriesPage.tsx": "Displays a photo collage background with overlay effects and a list of memory captions rendered as text with drop-shadow styling.",
  "frontend/src/pages/OneChancePage.tsx": "Page with two interactive buttons where 'Try Again' triggers hearts and love message, while 'Time' button moves randomly on click.",
  "frontend/src/pages/QuestionPage.tsx": "Empty file with no content.",
  "frontend/src/pages/UnderstandingPage.tsx": "Simple text-based page displaying apology and commitment messages with navigation buttons to previous and next pages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, pink/gold color palettes, custom shadows, and animation definitions including float, fadeIn, and glow.",
  "project_state.json": "Project metadata tracking a fix request to remove blur backgrounds from text lines in the memories page."
}