{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report documenting implemented React Router navigation with 6 pages, landing page with romantic messaging, memories photo gallery, understanding/apology page, one-chance commitment page, interactive question page, and final page with animations.",
  "frontend-file-summaries.txt": "JSON object containing brief descriptions of all frontend files including components, pages, hooks, and configuration files for the romantic multi-page website.",
  "frontend/index.css": "Duplicate of frontend/src/index.css containing Tailwind base styles with OKLCH color system variables for light and dark themes.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the React application titled 'Love Letter'.",
  "frontend/README.md": "Documentation instructing users how to replace three placeholder memory images (memory-1.jpg, memory-2.jpg, memory-3.jpg) in the public/assets directory without code changes.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with 6 routes (landing, memories, understanding, one-chance, question, final) wrapped in Layout component.",
  "frontend/src/components/ActionButtonsSection.tsx": "Empty component file for action buttons section (not yet implemented).",
  "frontend/src/components/ClosingSection.tsx": "Empty component file for closing section (not yet implemented).",
  "frontend/src/components/GallerySection.tsx": "Empty component file for gallery section (not yet implemented).",
  "frontend/src/components/HeroSection.tsx": "Empty component file for hero section (not yet implemented).",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing floating hearts background animation, router outlet, and footer with caffeine.ai attribution across all pages.",
  "frontend/src/components/QuestionSection.tsx": "Empty component file for question section (not yet implemented).",
  "frontend/src/components/UnderstandingSection.tsx": "Empty component file for understanding section (not yet implemented).",
  "frontend/src/hooks/useActor.ts": "Custom hook managing ICP backend actor creation with Internet Identity authentication, query caching, and automatic invalidation on identity changes.",
  "frontend/src/hooks/useHeartAnimation.ts": "Custom hook that creates and animates 20 floating heart emojis with random positions and sizes across the viewport for 5 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Global styles with Tailwind layers, OKLCH color system for romantic pink/white palette, golden glow effects, floating hearts animations, responsive typography, and custom component utilities.",
  "frontend/src/main.tsx": "React application entry point setting up QueryClient, InternetIdentityProvider, and rendering the App component into the root DOM element.",
  "frontend/src/pages/FinalPage.tsx": "Final page component that triggers heart animations on mount and displays a centered message about choosing to stay together with effort as the solution.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with a romantic greeting message and a call-to-action button that navigates to the memories page.",
  "frontend/src/pages/MemoriesPage.tsx": "Memories page displaying a grid of three photo memories with captions and navigation buttons to move back or forward through the site flow.",
  "frontend/src/pages/OneChancePage.tsx": "Page requesting a second chance with two action buttons and a next navigation button to proceed to the question page.",
  "frontend/src/pages/QuestionPage.tsx": "Interactive question page asking if the user still loves them, featuring a 'No' button that moves randomly on click with a popup message, and a 'Yes' button that triggers hearts and shows a response.",
  "frontend/src/pages/UnderstandingPage.tsx": "Understanding page with apologetic text acknowledging past mistakes and promising to prove commitment through actions, with back/next navigation buttons.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (including pink and gold palettes using oklch), animations (float, fadeIn, glow), custom shadows, and typography plugin.",
  "project_state.json": "Project metadata file documenting the multi-page romantic website architecture, design theme (pink/white gradient with golden glow), required placeholder images for the gallery, and existing feature implementations."
}