{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister entry point.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: expanding the memories gallery to 9 photos in a 3x3 grid, restructuring navigation from 6 to 5 pages by merging One Chance and Question pages, adding romantic message and heart animation on button click, and making the 'time' button move randomly when clicked.",
  "frontend-file-summaries.txt": "JSON object containing brief descriptions of all frontend files including pages, components, hooks, and configuration files for the romantic multi-page website.",
  "frontend/index.css": "Duplicate of frontend/src/index.css containing Tailwind directives and CSS custom properties for theming.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the React application from main.tsx.",
  "frontend/README.md": "Documentation instructing users how to replace the 9 placeholder images (memory-1.jpg through memory-9.jpg) in the assets directory with personal photos.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with 5 routes (landing, memories, understanding, one-chance, final) wrapped in a Layout component.",
  "frontend/src/components/ActionButtonsSection.tsx": "Empty component file (no content).",
  "frontend/src/components/ClosingSection.tsx": "Empty component file (no content).",
  "frontend/src/components/GallerySection.tsx": "Empty component file (no content).",
  "frontend/src/components/HeroSection.tsx": "Empty component file (no content).",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing floating hearts background animation, router outlet, and footer with caffeine.ai attribution across all pages.",
  "frontend/src/components/QuestionSection.tsx": "Empty component file (no content).",
  "frontend/src/components/UnderstandingSection.tsx": "Empty component file (no content).",
  "frontend/src/hooks/useActor.ts": "Custom hook managing ICP backend actor creation with Internet Identity authentication, using React Query for caching and automatic invalidation on identity changes.",
  "frontend/src/hooks/useHeartAnimation.ts": "Custom hook providing triggerHearts function that creates and animates 20 floating heart emojis across the viewport for 5 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Global styles with Tailwind directives, OKLCH color system for romantic pink/white theme, custom CSS variables, golden glow effects, floating heart animations, and responsive design utilities.",
  "frontend/src/main.tsx": "React app entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component with necessary providers.",
  "frontend/src/pages/FinalPage.tsx": "Final page component displaying a heartfelt message in Hinglish about choosing to stay together, with heart animation triggered on mount.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with a romantic greeting and call-to-action button that navigates to the memories page.",
  "frontend/src/pages/MemoriesPage.tsx": "Displays a 3x3 grid of 9 memory photos with captions and navigation buttons to previous/next pages.",
  "frontend/src/pages/OneChancePage.tsx": "Interactive page with moving buttons, a mini yes/no game, and multiple conditional messages based on user interactions with heart animations.",
  "frontend/src/pages/QuestionPage.tsx": "Empty component file with no content.",
  "frontend/src/pages/UnderstandingPage.tsx": "Displays apologetic and understanding messages in Hinglish with navigation buttons to previous and next pages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (pink, gold, OKLCH colors), animations (float, fadeIn, glow), and extended theme settings including shadows and fonts.",
  "project_state.json": "Project metadata describing a 5-page romantic website with pink/white theme, 9-photo gallery, interactive elements, and Hinglish content with architectural notes and image requirements."
}